Revit 2027 API
BuiltInFailures.ConnectorFailures.UndefinedConnector Property
 Revit does not support Undefined connectors. The following have been replaced by the default connector: [Connector Element]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UndefinedConnector { get; }
Public Shared ReadOnly Property UndefinedConnector As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UndefinedConnector {
	FailureDefinitionId^ get ();
}
static member UndefinedConnector : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace